<template>
  <!-- 参考: https://kiyaku.jp/hinagata/sns.html -->
  <!-- TODO: 利用規約内容の更新 -->
  <h1 class="font-bold text-2xl">利用規約</h1>
  <p class="mt-2">この利用規約（以下、「本規約」といいます）は、{{ businessOperatorName }}（以下、「サイト運営者」といいます）がこのウェブサイト上で提供するサービス（以下、「本サービス」といいます）の利用条件を定めるものです。サイト利用者は、本サービスを利用するために本規約、及び別途定める<a href="/privacy-policy" class="hover:underline">プライバシーポリシー</a>に同意する必要があります。</p>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第1条（定義）</h2>
    <p class="mt-2 ml-1">本規約において、以下の用語は、別途定義されている場合及び文脈上別異に解すべき場合を除き、以下の意味を有するものとします。</p>
    <ol class="list-decimal ml-6">
      <li>「ユーザー」とは、本サービスにおいて相談を申し込む者をいいます。</li>
      <li>「コンサルタント」とは、本サービスにおいて相談を受け付ける者をいいます。</li>
      <li>「サイト利用者」とは、ユーザーとコンサルタントを総称したものを指します。</li>
      <li>「相談」とは、コンサルタントがユーザーからの質問に回答したり、コンサルタントが自身の経験をユーザーに伝える事を主旨とした話し合いの場を指します。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第2条（適用）</h2>
    <ol class="list-decimal ml-6">
      <li>本規約は、サイト利用者とサイト運営者との間の本サービスの利用に関わる一切の関係に適用されるものとします。</li>
      <li>サイト運営者は本サービスに関し、本規約のほか、ご利用にあたってのルール等、各種の定め（以下、「個別規定」といいます）をすることがあります。これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。</li>
      <li>本規約の規定が前条の個別規定の規定と矛盾する場合には、個別規定において特段の定めなき限り、個別規定の規定が優先されるものとします。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第3条（利用登録）</h2>
    <ol class="list-decimal ml-6">
      <li>利用登録とは、アカウント作成時に行う識別、認証情報の登録のみでなく、ユーザーやコンサルタントとしてサービスを利用するために必要な情報を登録する手続き全般を指す。本サービスにおいては、利用登録希望者が本規約に同意の上、サイト運営者の定める方法によって利用登録を申請する。その後、本サービスが利用登録完了を通知することによって、利用登録が完了するものとします。なお、本サービスの利用登録にあたり、下記の事項を確認し、同意しなければなりません。
        <ol class="list-decimal ml-6">
          <li>利用登録の申請は本人がしなければならないこと</li>
          <li>利用登録の申請に際して、虚偽の事項を記入しないこと、入力内容に誤記がないこと、また、必須の内容に記入漏れがないこと</li>
          <li>利用登録の申請者は利用登録時点で成年であることを証明できること</li>
          <li>サイト利用者に対して、本サービスの利用を妨害、もしくは支障をきたす行為を行わないこと</li>
          <li>反社会的勢力でないこと</li>
          <li>本規約に違反したことがないこと</li>
          <li>通信環境が本サービスの利用に支障がないことを確認しなければならないこと</li>
          <li>本サービスが利用登録の申請者に対して電子メールによる通知、アンケート等の実施を許可すること</li>
          <li>サービス品質向上のため、サイト運営者が本サービスに対する問い合わせ内容等を記録、録音、保管できること</li>
        </ol>
      </li>
      <li>サイト運営者は、利用登録の申請者に以下の事由があると判断した場合、利用登録の申請を承認しないことがあり、利用登録が済んだ後であっても当該登録を取り消すことができる。加えて、その理由については一切の開示義務を負わないものとします。
        <ol class="list-decimal ml-6">
          <li>実在しない人物、もしくは実在しない人物である恐れがあると判断した場合</li>
          <li>同一人物により複数の利用登録がされた、またはその恐れがある場合</li>
          <li>利用登録の申請に際して、虚偽の事項を記入した場合、または入力内容に誤記、記入漏れがある場合</li>
          <li>利用登録の申請者が成年でない、またはその恐れがあると判断した場合</li>
          <li>本サービスが提供する決済手段において、当該申請者がその決済手段を利用可能でない場合</li>
          <li>サイト利用者に対して、本サービスの利用を妨害する、または支障をきたす行為を行った場合、またはその恐れがある場合</li>
          <li>反社会的勢力であることが判明した場合、またはその恐れがある場合</li>
          <li>本規約に違反したことがある者からの申請である場合</li>
          <li>その他、サイト運営者が利用登録を相当でないと判断した場合</li>
        </ol>
      </li>
      <li>利用登録を申請した者は、その内容に変更の必要性が生じた場合、サイト運営者が定める手段により、遅滞なく変更手続きを行うものとします。同変更手続きが遅滞したことにより利用登録を申請したものが損害等を被った場合において、サイト運営者は一切責任を負わないものとします。また、同変更手続きが遅滞したことによりサイト運営者が損害等を受けた場合、サイト利用者はその損害等を賠償する責任を負います。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第4条（識別、認証情報の管理）</h2>
    <ol class="list-decimal ml-6">
      <li>サイト利用者は、自己の責任において、本サービスがサイト利用者を識別、認証のために必要な情報（メールアドレス、パスワード等）を適切に管理するものとします。</li>
      <li>サイト利用者は、いかなる場合にも、本サービスがサイト利用者を識別、認証のために必要な情報を第三者に譲渡または貸与すること、もしくは第三者と共用することはできません。サイト運営者は、本サービスがサイト利用者を識別、認証のために必要な情報の組み合わせが登録情報と一致してログインされた場合には、その情報を登録しているサイト利用者自身による利用とみなします。</li>
      <li>本サービスがサイト利用者を識別、認証のために必要な情報を失念した場合、または第三者に不正に使用されている疑いがある場合、サイト運営者に対して速やかに連絡を行い、指示等に従わなければならない。なお、サイト利用者は当該連絡を遅滞したことにより生じるすべての損害等を賠償する義務を負うものとします。</li>
      <li>本サービスがサイト利用者を識別、認証のために必要な情報が第三者によって使用されたことによって生じた損害は、サイト運営者に故意又は重大な過失がある場合を除き、サイト運営者は一切の責任を負わないものとします。</li>
      <li>本サービスがサイト利用者を識別、認証のために必要な情報が、サイト利用者の管理不十分に起因して不正に利用された場合、サイト運営者に故意又は重大な過失がある場合を除き、サイト利用者は生じた損害等の賠償の責任を負います。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第5条（禁止事項）</h2>
    <p>サイト利用者は、本サービスの利用にあたり、以下の行為をしてはなりません。なお、禁止事項に該当する行為か否かの判断は、サイト運営者の裁量により判断されるものとし、その判断について説明責任は負わないものとします。</p>
    <ol class="list-decimal ml-8">
      <li>法令または公序良俗に違反する行為</li>
      <li>犯罪行為に関連する行為</li>
      <li>サイト運営者、本サービスの他のサイト利用者、または第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
      <li>本サービスの運営を妨害するおそれのある行為</li>
      <li>他のサイト利用者に関する個人情報等を収集または蓄積する行為</li>
      <li>不正アクセスをし、またはこれを試みる行為</li>
      <li>他のサイト利用者に成りすます行為</li>
      <li>本サービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
      <li>サイト運営者、本サービスの他のサイト利用者または第三者の知的財産権、肖像権、プライバシー、名誉その他の権利または利益を侵害する行為</li>
      <li>一人で複数のアカウントを登録する行為</li>
      <li>複数人で一つのアカウントを利用する行為</li>
      <li>泥酔状態で相談を行う行為</li>
      <li>相談にユーザー、コンサルタント以外の第三者を同席させる行為</li>
      <li>相談を欠席する行為</li>
      <li>相談の内容（録音音声のみでなく、その相談内容を記録したメモも含む）を許可なく公開する行為</li>
      <li>組戻しが発生した場合、サイト利用者がその組戻し料金の支払いを拒否する行為</li>
      <li>以下の表現を含み、もしくは含むとサイト運営者が判断する表現を本サービス上に公開、または相談内でやり取りする行為
        <ol class="list-decimal ml-6">
          <li>過度に暴力的な表現</li>
          <li>露骨な性的表現</li>
          <li>人種、国籍、信条、性別、社会的身分、門地等による差別につながる表現</li>
          <li>自殺、自傷行為、薬物乱用を誘引または助長する表現</li>
          <li>社外秘、もしくはそれに類する一般的に開示されていない機密情報を含む表現</li>
          <li>その他反社会的な内容を含み他人に不快感を与える表現</li>
        </ol>
      </li>
      <li>以下を目的とし、または目的とするとサイト運営者が判断する行為
        <ol class="list-decimal ml-6">
          <li>営業、宣伝、広告、勧誘、その他営利を目的とする行為</li>
          <li>性行為やわいせつな行為を目的とする行為</li>
          <li>異性との出会いや交際を目的とする行為</li>
          <li>他のサイト利用者に対する嫌がらせや誹謗中傷を目的とする行為</li>
          <li>サイト運営者、本サービスの他のサイト利用者、または第三者に不利益、損害または不快感を与えることを目的とする行為</li>
          <li>その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為</li>
        </ol>
      </li>
      <li>宗教活動または宗教団体への勧誘行為</li>
      <li>その他、サイト運営者が不適切と判断する行為</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第6条（罰則規定）</h2>
    <ol class="list-decimal ml-6">
      <li>サイト運営者は、サービス利用者が本規約に違反した行為を行ったと判断した場合、サービスの提供状態を問わず、サービス利用者に事前の通知等を要せず、本サービスの利用停止、アカウントの削除を行うことができるものとします。加えて、サイト運営者はその判断理由については一切の開示義務を負わず、発生する損害等にも賠償する義務を負わないものとします。</li>
      <li>罰則規定を理由とした処分を受けた場合、サイト利用者が既に支払った相談料の返金は一切行わないものとします。</li>
      <li>罰則規定を理由とした処分を受けた場合、サイト利用者が受け取る予定であった報酬の支払いは保証されないものとします。</li>
      <li>本規約に違反した行為により、サイト運営者、他のサイト利用者、または第三者に損害等を生じさせた場合、サイト利用者は本サービス退会後であっても、すべての法的責任を負うものとし、いかなる場合も発生した損害等を賠償する義務を負うものとします。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第7条（通知）</h2>
    <ol class="list-decimal ml-6">
      <li>全体、または一部のサイト利用者に対する通知は、サイト運営者が<a href="/news" class="hover:underline">お知らせ</a>に情報を掲載した時点で通知が完了したものとみなします。</li>
      <li>個別のサイト利用者に対する通知は、本サービスからサイト利用者の電子メールアドレスへの電子メールの発信をもって完了したものとみなします。</li>
      <li>サイト利用者は、本サービスからの電子メールを受け取るために電子メールアカウントを適切に管理し、各種電子メールの受信設定を行わなければならない。</li>
      <li>サイト利用者がお知らせの確認、または電子メールの確認、電子メールアカウントの管理、各種電子メールの設定を怠ったことに起因して発生した損害等に関して、サイト運営者は責任を負わないものとします。</li>
      <li>サイト利用者がお知らせの確認、または電子メールの確認、電子メールアカウントの管理、各種電子メールの設定を怠ったことに起因して、サイト運営者、本サービスの他のサイト利用者、または第三者に損害等を発生させた場合、その賠償の責任を負うこととします。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第8条（本サービスの提供の停止等）</h2>
    <ol class="list-decimal ml-6">
      <li>サイト運営者は、以下のいずれかの事由があると判断した場合、サイト利用者に事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
        <ol class="list-decimal ml-6">
          <li>本サービスにかかるコンピュータシステムの定期的または緊急の保守点検、更新を行う場合</li>
          <li>火災、停電等により本サービスの提供ができなくなった場合</li>
          <li>地震、噴火、洪水、津波、落雷等その他天災により、本サービスの提供が困難となった場合</li>
          <li>戦争、暴動、労働争議等その他不可抗力により、本サービスの提供が困難となった場合</li>
          <li>コンピュータまたは通信回線等が事故により停止した場合</li>
          <li>法令又はこれに基づく措置により本サービスの提供ができなくなった場合</li>
          <li>その他運用上又は技術上、サイト運営者が本サービスの提供が困難と判断した場合</li>
        </ol>
      </li>
      <li>サイト運営者は、本サービスの提供の停止または中断により、サイト利用者または第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第9条（著作権）</h2>
    <ol class="list-decimal ml-6">
      <li>サイト利用者は、自ら著作権等の必要な知的財産権を有するか、または必要な権利者の許諾を得た文章、画像や映像等の情報に関してのみ、本サービスを利用し、投稿ないしアップロードすることができるものとします。</li>
      <li>サイト利用者が本サービスを利用して投稿ないしアップロードした文章、画像、映像等の著作権については、当該サイト利用者その他既存の権利者に留保されるものとします。ただし、サイト運営者は、本サービスを利用して投稿ないしアップロードされた文章、画像、映像等について、本サービスの改良、品質の向上、または不備の是正等ならびに本サービスの周知宣伝等に必要な範囲で利用できるものとし、サイト利用者は、この利用に関して、著作者人格権を行使しないものとします。</li>
      <li>前項本文の定めるものを除き、本サービスおよび本サービスに関連する一切の情報についての著作権およびその他の知的財産権はすべてサイト運営者またはサイト運営者にその利用を許諾した権利者に帰属し、サイト利用者は無断で複製、譲渡、貸与、翻訳、改変、転載、公衆送信（送信可能化を含みます）、伝送、配布、出版、営業使用等をしてはならないものとします。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第10条（相談料の返金）</h2>
    <ol class="list-decimal ml-6">
      <li>サイト運営者はユーザーからの相談料の返金要求は受け付けないものとする。但し、下記のすべてを満たす場合、返金要求を受け付ける場合がある。
        <ol class="list-decimal ml-6">
          <li>ユーザーがコンサルタントの評価を行っていない場合</li>
          <li>ユーザーが相談日時に相談室に入室した記録が確認できる場合</li>
          <li>ユーザーがサイト運営者が定める手段により、当該相談の終了日時から遅滞なく返金要求の連絡を行っている場合</li>
          <li>前項のユーザーからサイト運営者への連絡に、返金が必要な理由と返金手続きに必要なすべての情報が網羅的に記載されており、かつ記載が簡潔でサイト運営者が理解できる内容となっている場合</li>
          <li>返金の対象とした相談料に関して、過去に当該相談料を対象とした返金要求を行っていない場合</li>
          <li>サイト運営者が、当該ユーザーに瑕疵、過失がないと判断した場合</li>
          <li>サイト運営者が、当該ユーザーの相談相手となったコンサルタントに明らかな瑕疵、または重大な過失があったと判断した場合</li>
          <li>その他、サイト運営者が返金要求を受け付ける必要があると判断した場合</li>
        </ol>
      </li>
      <li>コンサルタントは相談料の返金要求が発生した際、サイト運営者からの当該要求が発生した旨の連絡を受け付けなければならないものとします。</li>
      <li>コンサルタントは相談料の返金要求が発生した際、内容を確認し、事実と異なる箇所がある場合、反論することができるものとする。反論を行う際は、下記のすべてを満たしていなければならないものとする。
        <ol class="list-decimal ml-6">
          <li>サイト運営者が定める手段により、遅滞なく反論を含めた連絡を行うこと</li>
          <li>反論の内容に客観的証拠を含めること</li>
          <li>反論の内容に関して、記載が簡潔かつ明瞭でサイト運営者が理解できる内容となっていること</li>
          <li>その他、サイト運営者が反論に必要と判断した要件が漏れていないこと</li>
        </ol>
      </li>
      <li>コンサルタントは、返金要求に対する反論としてサイト運営者に連絡できる機会は一度のみとする。</li>
      <li>サイト運営者は、サイト利用者に対して相談料の返金をする、しないの判断に関わらず、その判断に至った理由を開示する義務を負わないものとします。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第8条（利用制限および登録抹消）</h2>
    <ol class="list-decimal ml-6">
      <li>当社は，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，投稿データを削除し，ユーザーに対して本サービスの全部もしくは一部の利用を制限しまたはユーザーとしての登録を抹消することができるものとします。
              <ol class="list-decimal ml-6"><li>本規約のいずれかの条項に違反した場合</li><li>登録事項に虚偽の事実があることが判明した場合</li><li>決済手段として当該ユーザーが届け出たクレジットカードが利用停止となった場合</li><li>料金等の支払債務の不履行があった場合</li><li>当社からの連絡に対し，一定期間返答がない場合</li><li>本サービスについて，最終の利用から一定期間利用がない場合</li><li>その他，当社が本サービスの利用を適当でないと判断した場合</li></ol></li>
      <li>前項各号のいずれかに該当した場合，ユーザーは，当然に当社に対する一切の債務について期限の利益を失い，その時点において負担する一切の債務を直ちに一括して弁済しなければなりません。</li>
      <li>当社は，本条に基づき当社が行った行為によりユーザーに生じた損害について，一切の責任を負いません。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第9条（退会）</h2>
    <p>ユーザーは，当社の定める退会手続により，本サービスから退会できるものとします。</p>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第10条（保証の否認および免責事項）</h2>
    <ol class="list-decimal ml-6">
      <li>本サービスの利用に関わらないところで発生したサイト利用者同士の私的なトラブルに関して、サービス運営者は一切責任を負わないものとします。</li>
      <li>当社は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。</li>
      <li>当社は，本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。ただし，本サービスに関する当社とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。</li>
      <li>前項ただし書に定める場合であっても，当社は，当社の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（当社またはユーザーが損害発生につき予見し，または予見し得た場合を含みます。）について一切の責任を負いません。また，当社の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害の賠償は，ユーザーから当該損害が発生した月に受領した利用料の額を上限とします。</li>
      <li>当社は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。</li>
    </ol>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第11条（サービス内容の変更等）</h2>
    <p>当社は，ユーザーに通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。</p>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第12条（利用規約の変更）</h2>
    <p>当社は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，当該ユーザーは変更後の規約に同意したものとみなします。</p>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第13条（個人情報の取扱い）</h2>
    <p>当社は，本サービスの利用によって取得する個人情報については，当社「プライバシーポリシー」に従い適切に取り扱うものとします。</p>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第14条（通知または連絡）</h2>
    <p>ユーザーと当社との間の通知または連絡は，当社の定める方法によって行うものとします。当社は,ユーザーから,当社が別途定める方式に従った変更届け出がない限り,現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い,これらは,発信時にユーザーへ到達したものとみなします。</p>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第15条（権利義務の譲渡の禁止）</h2>
    <p>ユーザーは，当社の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。</p>
  </div>
  <div class="mt-4">
    <h2 class="font-bold text-xl">第16条（準拠法・裁判管轄）</h2>
    <ol class="list-decimal ml-6">
      <li>本規約の解釈にあたっては，日本法を準拠法とします。</li>
      <li>本サービスに関して紛争が生じた場合には，当社の本店所在地を管轄する裁判所を専属的合意管轄とします。</li>
    </ol>
  </div>
  <p class="mt-4">以上</p>
</template>

<script lang="ts">
import { defineComponent } from 'vue'

export default defineComponent({
  name: 'TermsOfUse',
  setup () {
    const businessOperatorName = process.env.VUE_APP_BUSINESS_OPERATOR_NAME

    return {
      businessOperatorName
    }
  }
})
</script>
