<template>
  <div class="bg-gradient-to-r from-gray-500 to-gray-900 min-h-screen pt-12 md:pt-20 pb-6 px-2 md:px-0" style="font-family:'Lato',sans-serif;">
    <header class="max-w-lg mx-auto">
      <router-link to="/">
        <h1 class="text-2xl font-bold text-white text-center">就職先・転職先を見極めるためのサイト</h1>
      </router-link>
    </header>
    <main class="bg-white max-w-3xl mx-auto p-8 md:p-12 my-10 rounded-lg shadow-2xl">
      <!-- TODO: プライバシーポリシーの更新 -->
      <!-- TODO: クレジットのEV3Dセキュア利用時に個人情報を渡す旨の同意を取る文言をプライバシーポリシーに記載する -->
      <!-- 参考: https://payjp-document.s3.ap-northeast-1.amazonaws.com/PAY.JP_3D%E3%82%BB%E3%82%AD%E3%83%A5%E3%82%A2_EMV3D%E3%82%BB%E3%82%AD%E3%83%A5%E3%82%A2%E7%A7%BB%E8%A1%8C%E3%81%AB%E3%81%A4%E3%81%84%E3%81%A6.pdf -->
      <h1 class="font-bold text-2xl">プライバシーポリシー</h1>
      <p class="mt-2">{{ businessOperatorName }}（以下、「サイト運営者」といいます）は、本ウェブサイト上で提供するサービス（以下、「本サービス」といいます）における、サイト利用者の個人情報の取扱いについて、以下のとおりプライバシーポリシー（以下、「本ポリシー」といいます）を定めます。</p>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第1条（個人情報）</h2>
        <p class="ml-1">「個人情報」とは、個人情報保護法にいう「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日、住所、電話番号、連絡先その他の記述等により特定の個人を識別できる情報及び容貌、指紋、声紋にかかるデータ、及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を指します。</p>
      </div>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第2条（個人情報の収集方法）</h2>
        <p class="ml-1">サイト運営者は、サイト利用者が利用登録、相談の申し込み、または報酬の受け取り口座を登録する際に氏名、生年月日、住所、電話番号、メールアドレス、口座番号、クレジットカード番号、デバイス情報、IPアドレス、運転免許証番号などの個人情報をお尋ねすることがあります。また、サイト利用者と提携先等との間でなされたサイト利用者の個人情報を含む取引記録や決済に関する情報を、サイト運営者の提携先（情報提供元、広告主、広告配信先などを含みます。以下、｢提携先｣といいます）などから収集することがあります。</p>
      </div>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第3条（取得情報の管理）</h2>
        <p class="ml-1">サイト運営者は、サイト利用者からの取得情報について厳重に管理を行い、個人情報への不当なアクセス、紛失、漏洩、改ざん等が起きないよう、取得情報の取扱に十分な注意を払い、その業務に努めます。</p>
      </div>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第4条（個人情報を収集・利用する目的）</h2>
        <p class="ml-1">サイト運営者が個人情報を収集・利用する目的は、以下のとおりです。</p>
        <ol class="list-decimal ml-6">
          <li>本サービスの提供・運営のため</li>
          <li>本サービスのサービス品質の改善、向上のため</li>
          <li>サイト利用者からのお問い合わせに回答するため（本人確認を行うことを含む）</li>
          <li>サイト利用者に本サービスの新機能、更新情報、またはアンケート等についてメールを送付するため</li>
          <li>本サービスに関するメンテナンス、重要なお知らせなど必要に応じたご連絡のため</li>
          <li>クレジットカードの不正利用の検知、防止のための仕組み（EMV 3Dセキュア）を利用するため</li>
          <li>利用規約に違反したサイト利用者や、不正・不当な目的でサービスを利用しようとするサイト利用者の特定をし、ご利用をお断りするため</li>
          <li>サイト利用者にご自身の利用登録情報の閲覧や変更、削除、ご利用状況の閲覧を行っていただくため</li>
          <li>本サービスの利用に関わるところで発生したサイト利用者同士の紛争、または相談料の返金に関して、サイト利用者間を仲介する際に連絡をとるため</li>
          <li>上記の利用目的に付随する目的</li>
        </ol>
      </div>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第5条（利用目的の変更）</h2>
        <ol class="list-decimal ml-6">
          <li>サイト運営者は、利用目的が変更前と関連性を有すると合理的に認められる場合に限り、個人情報の利用目的を変更するものとします。</li>
          <li>利用目的の変更を行った場合には、変更後の目的について、サイト運営者所定の方法により、サイト利用者に通知し、または本ウェブサイト上に公表するものとします。</li>
        </ol>
      </div>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第6条（個人情報の第三者提供）</h2>
        <ol class="list-decimal ml-6">
          <li>サイト運営者は、次に掲げる場合を除いて、あらかじめサイト利用者の同意を得ることなく、第三者に個人情報を提供することはありません。ただし、個人情報保護法その他の法令で認められる場合を除きます。
            <ol class="list-decimal ml-6">
              <li>人の生命、身体または財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき</li>
              <li>公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき</li>
              <li>国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき</li>
              <li>予め次の事項を告知あるいは公表し、かつサイト運営者が個人情報保護委員会に届出をしたとき
                <ol class="list-decimal ml-6">
                  <li>利用目的に第三者への提供を含むこと</li>
                  <li>第三者に提供されるデータの項目</li>
                  <li>第三者への提供の手段または方法</li>
                  <li>本人の求めに応じて個人情報の第三者への提供を停止すること</li>
                  <li>本人の求めを受け付ける方法</li>
                </ol>
              </li>
            </ol>
          </li>
          <li>前項の定めにかかわらず、次に掲げる場合には、当該情報の提供先は第三者に該当しないものとします。
            <ol class="list-decimal ml-6">
              <li>サイト運営者が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合</li>
              <li>合併その他の事由による事業の承継に伴って個人情報が提供される場合</li>
              <li>個人情報を特定の者との間で共同して利用する場合であって、その旨並びに共同して利用される個人情報の項目、共同して利用する者の範囲、利用する者の利用目的および当該個人情報の管理について責任を有する者の氏名または名称について、あらかじめ本人に通知し、または本人が容易に知り得る状態に置いた場合</li>
              <li>不正利用検知、防止のため、サイト利用者が利用しているカードの発行会社に個人情報が提供される場合</li>
            </ol>
          </li>
        </ol>
      </div>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第7条（個人情報の開示）</h2>
        <ol class="list-decimal ml-6">
          <li>サイト利用者はいつでも利用登録されている個人情報を本サービス上で確認、訂正することが出来ます。サイト利用者はサイト運営者に対し、本サービス上で確認できない個人情報または第三者提供記録の開示を求める場合、サイト運営者が別途定めた手続きに従い、開示を請求することが出来ます。ただし、開示することにより次のいずれかに該当する場合は、その全部または一部を開示しないこともあり、開示しない決定をした場合には、その旨を遅滞なく通知します。なお、個人情報の開示に際しては、実費を勘定して合理的であると認められる範囲の手数料を請求いたします。
            <ol class="list-decimal ml-6">
              <li>本人または第三者の生命、身体、財産その他の権利利益を害するおそれがある場合</li>
              <li>サイト運営者の業務の適正な実施に著しい支障を及ぼすおそれがある場合</li>
              <li>その他法令に違反することとなる場合</li>
            </ol>
          </li>
          <li>前項の定めにかかわらず、履歴情報および特性情報などの個人情報以外の情報については、原則として開示いたしません。</li>
        </ol>
      </div>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第8条（個人情報の訂正および削除）</h2>
        <ol class="list-decimal ml-6">
          <li>サイト利用者は、サイト運営者の保有する自己の個人情報が誤った情報である場合には、サイト運営者が定める手続きにより、サイト運営者に対して個人情報の訂正、追加または削除（以下、「訂正等」といいます）を請求することができます。</li>
          <li>サイト運営者は、サイト利用者から前項の請求を受けてその請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の訂正等を行うものとします。</li>
          <li>サイト運営者は、前項の規定に基づき訂正等を行った場合、または訂正等を行わない旨の決定をしたときは遅滞なく、これをサイト利用者に通知します。</li>
        </ol>
      </div>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第9条（個人情報の利用停止等）</h2>
        <ol class="list-decimal ml-6">
          <li>サイト運営者は、本人から、個人情報が、利用目的の範囲を超えて取り扱われているという理由、または不正の手段により取得されたものであるという理由により、その利用の停止または消去（以下、「利用停止等」といいます）を求められた場合には、遅滞なく必要な調査を行います。</li>
          <li>前項の調査結果に基づき、その請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の利用停止等を行います。</li>
          <li>サイト運営者は、前項の規定に基づき利用停止等を行った場合、または利用停止等を行わない旨の決定をしたときは、遅滞なく、これをサイト利用者に通知します。</li>
          <li>前2項にかかわらず、利用停止等に多額の費用を有する場合その他利用停止等を行うことが困難な場合であって、サイト利用者の権利利益を保護するために必要なこれに代わるべき措置をとれる場合は、この代替策を講じるものとします。</li>
        </ol>
      </div>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第10条（プライバシーポリシーの変更）</h2>
        <ol class="list-decimal ml-6">
          <li>本ポリシーの内容は、法令その他本ポリシーに別段の定めのある事項を除いて、サイト利用者に通知することなく、変更することができるものとします。</li>
          <li>サイト運営者が別途定める場合を除いて、変更後のプライバシーポリシーは、本ウェブサイトに掲載したときから効力を生じるものとします。</li>
        </ol>
      </div>
      <div class="mt-4">
        <h2 class="font-bold text-xl">第11条（お問い合わせ窓口）</h2>
        <p class="ml-1">本ポリシーに関するお問い合わせは、下記の窓口までお願いいたします。</p>
      </div>
      <p class="mt-4">以上</p>
    </main>
    <footer class="max-w-lg mx-auto flex justify-center text-white">
      <router-link to="/" class="hover:underline">トップページへ</router-link>
    </footer>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue'

export default defineComponent({
  name: 'PrivacyPolicyPage',
  setup () {
    const businessOperatorName = process.env.VUE_APP_BUSINESS_OPERATOR_NAME
    const businessOperatorZipCode = process.env.VUE_APP_BUSINESS_OPERATOR_ZIP_CODE
    const businessOperatorAddress = process.env.VUE_APP_BUSINESS_OPERATOR_ADDRESS
    const businessOperatorInquiryEmailAddress = process.env.VUE_APP_BUSINESS_OPERATOR_INQUIRY_EMAIL_ADDRESS

    return {
      businessOperatorName,
      businessOperatorZipCode,
      businessOperatorAddress,
      businessOperatorInquiryEmailAddress
    }
  }
})
</script>
